In [3]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\srini\anaconda3\lib\site-packages (9.0.0)

In [38]:
import mysql.connector
from mysql.connector import Error
import pandas as pd
from datetime import datetime,date

In [21]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password
        )
        print("MySQL Database connection SUCCESSFULL")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [22]:
connection=create_server_connection("localhost","root","Malu@2005")

MySQL Database connection SUCCESSFULL

In [23]:
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Database created SUCCESSFULLY")
    except Error as err:
        print(f"Error:'{err}'")

In [24]:
create_db_query='CREATE DATABASE company'
create_database(connection,create_db_query)

Error:'1007 (HY000): Can't create database 'company'; database exists'

In [28]:
def create_db_connection(host_name,user_name,user_password,db_name):
    conn=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password,
            database=db_name
        )
        print("MySQL Database connection SUCCESSFULL")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [29]:
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query SUCCESSFULL")
    except Error as err:
        print(f"Error:'{err}'")

In [30]:
create_emp_table="""
CREATE TABLE emp(
    emp_no INT(11) NOT NULL AUTO_INCREMENT,
    first_name varchar(15) NOT NULL,
    last_name varchar(15) NOT NULL,
    hire_date varchar(15) NOT NULL,
    gender ENUM('M','F') NOT NULL,
    birth_date varchar(15) NOT NULL,
    PRIMARY KEY(emp_no)
    );
"""
connection=create_db_connection("localhost","root","Malu@2005",'company')
execute_query(connection,create_emp_table)

MySQL Database connection SUCCESSFULL
Query SUCCESSFULL

In [32]:
create_departments_table = """
CREATE TABLE departments (
    dept_no VARCHAR(10) NOT NULL,
    dept_name VARCHAR(40) NOT NULL,
    PRIMARY KEY (dept_no), 
    UNIQUE KEY dept_name(dept_name)
    );
"""
create_salaries_table = """
CREATE TABLE salaries (
    emp_no INT(11) NOT NULL,
    salary INT(11) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no,from_date), 
    KEY emp_no (emp_no),
    CONSTRAINT salaries_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES emp (emp_no) ON DELETE CASCADE
    );
"""
connection=create_db_connection("localhost","root",'Malu@2005','company')
execute_query(connection,create_departments_table)
execute_query(connection,create_salaries_table)

MySQL Database connection SUCCESSFULL
Error:'1050 (42S01): Table 'departments' already exists'
Query SUCCESSFULL

In [34]:
create_deptemp_table = """
CREATE TABLE dept_emp (
    emp_no INT(11) NOT NULL,
    dept_no VARCHAR(10) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no, dept_no), 
    KEY emp_no (emp_no),
    KEY dept_no (dept_no),
    CONSTRAINT dept_emp_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES emp (emp_no) ON DELETE CASCADE,
    CONSTRAINT dept_emp_ibfk_2 FOREIGN KEY (dept_no)
        REFERENCES departments (dept_no) ON DELETE CASCADE
);
"""

create_dept_manager_table = """
CREATE TABLE dept_manager (
    emp_no INT(11) NOT NULL,
    dept_no VARCHAR(10) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no, dept_no),
    KEY emp_no (emp_no),
    KEY dept_no (dept_no),
    CONSTRAINT dept_manager_ibfk_1 FOREIGN KEY (emp_no) 
        REFERENCES emp (emp_no) ON DELETE CASCADE,
    CONSTRAINT dept_manager_ibfk_2 FOREIGN KEY (dept_no)
        REFERENCES departments (dept_no) ON DELETE CASCADE
    );
"""
create_titles_table ="""
CREATE TABLE titles (
    emp_no INT(11) NOT NULL,
    title VARCHAR(50) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) DEFAULT NULL,
    PRIMARY KEY (emp_no,title,from_date), KEY emp_no (emp_no),
    CONSTRAINT titles_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES emp (emp_no) ON DELETE CASCADE
    );
"""
connection=create_db_connection("localhost","root",'Malu@2005','company')
execute_query(connection,create_deptemp_table)
execute_query(connection,create_dept_manager_table)
execute_query(connection,create_titles_table)

MySQL Database connection SUCCESSFULL
Error:'1050 (42S01): Table 'dept_emp' already exists'
Error:'1050 (42S01): Table 'dept_manager' already exists'
Query SUCCESSFULL

In [37]:
pop_employee = """
INSERT INTO emp VALUES
(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14'),
(2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01'), 
(3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01'),
(4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19'),
(5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17'),
(6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21'),
(7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29'),
(8, 'Radha',  'Marathe', '2020-03-29', 'F', '1988-11-22')
"""

connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')
execute_query(connection, pop_employee)

MySQL Database connection SUCCESSFULL
Query SUCCESSFULL

In [39]:
pop_dept = """
INSERT INTO departments VALUES
('HR01', 'Human Resources'),
('SFT01', 'S.Development'),
('SFT02', 'S.Testing'),
('MKT01', 'Marketing')
"""


pop_manager = """
INSERT INTO dept_manager VALUES
(2, 'SFT01','2008-12-20','2012-03-19'),
(3, 'MKT01', '2014-06-11', '2020-10-04'),
(6, 'SFT02', '2002-04-07','2004-11-10'),
(8, 'HR01', '2020-03-29','2022-03-03')
""" 
    

pop_title = """
INSERT INTO titles VALUES
(1,'Sr.Soft.Developer','2002-12-06', '2007-07-18'),
(2,'Soft.Developer Mngr.','2008-12-20', '2012-03-19'),
(3,'Marketing Mngr','2014-06-11', '2020-10-04'),
(4,'Soft.Tester','2000-08-23', '2005-12-03'),
(5,'HR Staff','2020-03-30','2021-10-09'),
(6,'Soft.Tester Mngr','2002-12-06','2004-11-10'),
(7,'Marketing Staff','2014-06-11','2016-12-04'),
(8,'HR Manager','2020-03-29','2022-03-03')
"""
    
    
connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')

execute_query(connection, pop_dept)
execute_query(connection, pop_manager)
execute_query(connection, pop_title)

MySQL Database connection SUCCESSFULL
Query SUCCESSFULL
Query SUCCESSFULL
Query SUCCESSFULL

In [42]:
#ALTERANTE METHOD FOR INSERTING VALUES
def execute_list_query(connection,sql,val):
    cursor=connection.cursor()
    try:
        cursor.executemany(sql,val)
        connection.commit()
        print("Query SUCCESSFULL")
    except Error as err:
        print(f "Error:'{err}'")

In [44]:
pop_salary = """INSERT INTO salaries (emp_no, salary, from_date, to_date) VALUES (%s, %s, %s, %s)"""

today = datetime.now().date()

sal_data = [(1, 1234567, '1999-02-20', today.isoformat()),
(2, 2345678, '2007-11-08', today.isoformat()),
(3, 3456789, '2014-06-11', today.isoformat()),
(4, 4567890, '2000-08-23', today.isoformat()),
(5, 5678901, '2020-03-30', today.isoformat()),
(6, 6789012, '1999-02-21', today.isoformat()),
(7, 7890123, '2014-06-11', today.isoformat()),
(8, 8901234, '2020-03-29', today.isoformat())]
    
pop_deptemp = """INSERT INTO dept_emp (emp_no, dept_no, from_date, to_date) VALUES (%s, %s, %s, %s)"""

deptemp_data = [(1, 'SFT01','1999-02-20', today.isoformat()),
(2, 'SFT01','2007-11-08',today.isoformat()),
(3, 'MKT01','2014-06-11',today.isoformat()),
(4, 'SFT02','2000-08-23',today.isoformat()),
(5, 'HR01','2020-03-30',today.isoformat()),
(6, 'SFT02','1999-02-21',today.isoformat()),
(7, 'MKT01','2014-06-11',today.isoformat()),
(8, 'HR01','2020-03-29',today.isoformat())]

connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')
execute_list_query(connection, pop_salary, sal_data)
execute_list_query(connection, pop_deptemp, deptemp_data)

MySQL Database connection SUCCESSFULL
Query SUCCESSFULL
Query SUCCESSFULL

In [45]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [47]:
q1 = """
SELECT *
FROM emp;
"""

connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')
results = read_query(connection, q1)

results

MySQL Database connection SUCCESSFULL

[(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14'),
 (2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01'),
 (3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01'),
 (4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19'),
 (5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17'),
 (6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21'),
 (7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29'),
 (8, 'Radha', 'Marathe', '2020-03-29', 'F', '1988-11-22')]

In [48]:
for r in results:
    print(r)

(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14')
(2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01')
(3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01')
(4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19')
(5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17')
(6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21')
(7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29')
(8, 'Radha', 'Marathe', '2020-03-29', 'F', '1988-11-22')

In [50]:
q2 = """
SELECT emp.first_name, emp.last_name FROM emp JOIN dept_manager ON emp.emp_no = dept_manager.emp_no;
"""
connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')
results = read_query(connection, q2)

print(results)

MySQL Database connection SUCCESSFULL
[('Shyam', 'Naik'), ('Baburao', 'Apte'), ('Suresh', 'Kadam'), ('Radha', 'Marathe')]

In [51]:
q3 = """
SELECT dept_emp.emp_no, emp.first_name, emp.last_name, dept_manager.dept_no, titles.title, salaries.from_date, salaries.to_date, salaries.salary FROM dept_emp  JOIN dept_manager ON dept_emp.emp_no = dept_manager.emp_no JOIN titles on dept_manager.emp_no = titles.emp_no JOIN emp ON emp.emp_no = dept_manager.emp_no JOIN salaries ON salaries.emp_no = dept_manager.emp_no"""

connection = create_db_connection("localhost", "root", 'Malu@2005', 'company')
results = read_query(connection, q3)

print(results)

MySQL Database connection SUCCESSFULL
[(2, 'Shyam', 'Naik', 'SFT01', 'Soft.Developer Mngr.', '2007-11-08', '2024-09-06', 2345678), (3, 'Baburao', 'Apte', 'MKT01', 'Marketing Mngr', '2014-06-11', '2024-09-06', 3456789), (6, 'Suresh', 'Kadam', 'SFT02', 'Soft.Tester Mngr', '1999-02-21', '2024-09-06', 6789012), (8, 'Radha', 'Marathe', 'HR01', 'HR Manager', '2020-03-29', '2024-09-06', 8901234)]

In [52]:
# Returns a list of lists and then creates a pandas DataFrame
import pandas as pd

columns = ["Employee_no", "First_name", "Last_name", "Department no.", "Job_role", "From_date", "To_date", "Salary"]
df = pd.DataFrame(results, columns=columns)

df.head()

,Employee_no,First_name,Last_name,Department no.,Job_role,From_date,To_date,Salary
0,2,Shyam,Naik,SFT01,Soft.Developer Mngr.,2007-11-08,2024-09-06,2345678
1,3,Baburao,Apte,MKT01,Marketing Mngr,2014-06-11,2024-09-06,3456789
2,6,Suresh,Kadam,SFT02,Soft.Tester Mngr,1999-02-21,2024-09-06,6789012
3,8,Radha,Marathe,HR01,HR Manager,2020-03-29,2024-09-06,8901234